In [1]:
!pip install selenium

Requirement already satisfied: selenium in c:\programdata\anaconda3\lib\site-packages (4.9.0)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\programdata\anaconda3\lib\site-packages (from selenium) (1.26.14)
Requirement already satisfied: trio-websocket~=0.9 in c:\programdata\anaconda3\lib\site-packages (from selenium) (0.10.2)
Requirement already satisfied: trio~=0.17 in c:\programdata\anaconda3\lib\site-packages (from selenium) (0.22.0)
Requirement already satisfied: certifi>=2021.10.8 in c:\programdata\anaconda3\lib\site-packages (from selenium) (2022.12.7)
Requirement already satisfied: outcome in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: sniffio in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: attrs>=19.2.0 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (22.1.0)
Requirement already satisfied: idna in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.4)
Requirement already satisfied: cffi>=1.14 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: async-generator>=1.9 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: sortedcontainers in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: exceptiongroup>=1.0.0rc9 in c:\programdata\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.1.1)
Requirement already satisfied: wsproto>=0.14 in c:\programdata\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\programdata\anaconda3\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\programdata\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\programdata\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

In [4]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [ ]:
# Q1

In [7]:
# First Connect to the driver
driver=webdriver.Chrome(r"C:\Users\Windows\Desktop\New folder\chromedriver.exe")

In [9]:
# Opening the naukri page on automated chrome browser
driver.get("http://www.naukri.com/")

In [15]:
# Entering designation and Location as required in the question number 1

designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Analyst')

In [16]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Bangalore')

In [17]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [18]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [19]:
#scraping job title from the given page
title_tags=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

#scraping job location from the given page 
location_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
#scraping company name from the given page
companyname_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in companyname_tags[0:10]:
    companyname=i.text
    company_name.append(companyname)

#scraping job Experience from the given page
experience_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience=i.text
    experience_required.append(experience)

In [20]:
#Checking the Lenght
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [21]:
#Creating the Data Frame.
data_frame1=pd.DataFrame({'Title':job_title, 'Location':job_location, 'Comapany Name':company_name, 'Experience':experience_required})
data_frame1

,Title,Location,Comapany Name,Experience
0,Data Analyst,Bangalore/Bengaluru,ANZ,6-9 Yrs
1,Data Analyst,Bangalore/Bengaluru,ANZ,6-10 Yrs
2,Data Analyst - IIT/BITS/Startups,Bangalore/Bengaluru,AVE Promagne,1-5 Yrs
3,Data Analyst - FinTech,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",Primo Hiring,1-2 Yrs
4,Data Analyst - FinTech,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Primo Hiring,1-2 Yrs
5,Data Analyst - FinTech,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Primo Hiring,1-2 Yrs
6,Data Analyst - IIT/BITS/Startups,Bangalore/Bengaluru,AVE Promagne,1-5 Yrs
7,Data Analyst,Bangalore/Bengaluru,Siemens,4-6 Yrs
8,Banking Data Analyst,"Bangalore/Bengaluru, Hyderabad/Secunderabad, G...",Coforge,5-10 Yrs
9,Data Analyst,Bangalore/Bengaluru,Dpdzero,1-3 Yrs

In [ ]:
#Q2

#Driver is already connected in the Q1, so not connecting again in Q2.
#Already naukri page is opend in automated chrome browser in Q1 so avoiding the same step in Q2.

In [28]:
# Entering designation and Location as required in the question number 2

designation_1=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation_1.send_keys('Data Scientist')

In [29]:
location_1=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/div[1]/div/input")
location_1.send_keys('Bangalore')

In [30]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [31]:
#Creating empty lists
job_title_1=[]
job_location_1=[]
company_name_1=[]

In [32]:
#scraping job title from the given page
title_tags_1=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags_1[0:10]:
    titles=i.text
    job_title_1.append(titles)

#scraping job location from the given page 
location_tags_1=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags_1[0:10]:
    locations=i.text
    job_location_1.append(locations)
    
#scraping company name from the given page
companyname_tags_1=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in companyname_tags_1[0:10]:
    companynames=i.text
    company_name_1.append(companynames)

In [33]:
#Checking the Lenght
print(len(job_title_1),len(job_location_1),len(company_name_1))

10 10 10

In [34]:
#Creating the Data Frame.
data_frame2=pd.DataFrame({'Title':job_title_1, 'Location':job_location_1, 'Comapany Name':company_name_1})
data_frame2

,Title,Location,Comapany Name
0,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture
1,Data Scientist_NLP,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics
2,Machine Learning (AI) Architect,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Persistent
3,Data Science Analyst,Bangalore/Bengaluru,Accenture
4,Data Scientist,Bangalore/Bengaluru,IBM
5,Data Scientist- Bangalore,Bangalore/Bengaluru,Trigent Software
6,Data Science Analyst - Data Science,Bangalore/Bengaluru,Accenture
7,Data Science Analyst Data Science,Bangalore/Bengaluru,Accenture
8,Analytics Specialist - Artificial Intelligence...,Bangalore/Bengaluru,Accenture
9,Senior Data Scientist,Bangalore/Bengaluru,Walmart

In [ ]:
#Q3.

In [35]:
# First Connect to the driver
driver=webdriver.Chrome(r"C:\Users\Windows\Desktop\New folder\chromedriver.exe")

In [37]:
# Opening the naukri page on automated chrome browser
driver.get("http://www.naukri.com/")

In [38]:
# Entering designation as required in the question number 3
designation_2=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation_2.send_keys('Data Scientist')

In [40]:
#Click search
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [41]:
#apply the location filter by checking the respective box
location_filter=driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[5]/div[2]/div[2]/label/p/span[1]")
location_filter.click()

In [42]:
#apply the salary filter by checking the respective box
salary_filter=driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[6]/div[2]/div[2]/label/p/span[1]")
salary_filter.click()

In [44]:
#Lets create empty list
job_title_2=[]
job_location_2=[]
company_name_2=[]
experience_required_2=[]

In [46]:
#scraping job title from the given page
title_tags_2=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags_2[0:10]:
    title_2=i.text
    job_title_2.append(title_2)

#scraping job location from the given page 
location_tags_2=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags_2[0:10]:
    location_2=i.text
    job_location_2.append(location_2)
    
#scraping company name from the given page
companyname_tags_2=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in companyname_tags_2[0:10]:
    companyname_2=i.text
    company_name_2.append(companyname_2)

#scraping job Experience from the given page
experience_tags_2=driver.find_elements(By.XPATH,'//div[@class="ellipsis job-description"]')
for i in experience_tags_2[0:10]:
    experience_2=i.text
    experience_required_2.append(experience_2)

In [47]:
#Checking the Lenght
print(len(job_title_2),len(job_location_2),len(company_name_2),len(experience_required_2))

10 10 10 10

In [48]:
#Creating the Data Frame.
data_frame3=pd.DataFrame({'Title':job_title_2, 'Location':job_location_2, 'Comapany Name':company_name_2, 'Experience':experience_required_2})
data_frame3

,Title,Location,Comapany Name,Experience
0,Junior Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,Experience : 0 to 2 years. Experience / Strong...
1,Data Scientist,"Gurgaon/Gurugram, Bangalore/Bengaluru",Blackbuck,Some of the problem areas are Insights across ...
2,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,You will collaborate with the brightest techni...
3,Junior Data Scientist,"Gurgaon/Gurugram, United States (USA), Bulgaria",Adidas,Four-year college or university degree with fo...
4,Data Scientist - II (Contract),Gurgaon/Gurugram,Netomi,"3+ years of experience as a data scientist, pr..."
5,Data Scientist,Noida,Gujarat Fluorochemicals,Functional Skills Required - Strong problem so...
6,Research Scientist - Bioinformatics,Gurgaon/Gurugram,Biopeople India,Experience in molecular biology and associated...
7,Data Scientist - I,Gurgaon/Gurugram,Netomi,Design and implement machine learning algorith...
8,Machine Learning Engineer,Noida,Profit By Outsourcing,2 years of relevant Machine learning experienc...
9,Assistant Manager - Data Scientist,Gurgaon/Gurugram,Fidelity International,"Graduation (must), preferably in Engineering, ..."

In [49]:
#Q4.

In [146]:
# Opening the flipkart page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [147]:
# Entering “sunglasses” in the search field
find=driver.find_element(By.CLASS_NAME,"_3704LK")
find.send_keys('Sunglasses')

In [148]:
#click the search icon
search=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/button")
search.click()

In [149]:
Brand=[]
Brand_description=[]
price=[]

In [155]:
# Scrapping brand name 
brand_name=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_name[0:100]:
    brandname=i.text
    Brand.append(brandname)
    
    
# Scrapping brand description   
    
brand_description=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in brand_description[0:100]:
    bd=i.text
    Brand_description.append(bd)
    
    
# Scrapping price on first page

pri=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in pri[0:100]:
    p=i.text
    price.append(p)

In [156]:
print(len(Brand),len(Brand_description),len(price))

120 114 120

In [157]:
#Creating the Data Frame.
data_frame4=pd.DataFrame({'Brande':Brand[0:100], 'Brande Description':Brand_description[0:100], 'Price':price[0:100]})
data_frame4

           Brande                                 Brande Description Price
0   VINCENT CHASE  by Lenskart Polarized, UV Protection Retro Squ...  ₹849
1   VINCENT CHASE     Polarized, UV Protection Round Sunglasses (50)  ₹789
2       Elligator             UV Protection Wayfarer Sunglasses (53)  ₹149
3       Elligator  UV Protection Cat-eye, Retro Square, Oval, Rou...  ₹109
4       Elligator  Polarized, UV Protection Retro Square Sunglass...  ₹149
..            ...                                                ...   ...
95  VINCENT CHASE  Gradient, UV Protection Wayfarer Sunglasses (F...  ₹949
96          NuVew        UV Protection Shield Sunglasses (Free Size)   ₹99
97      Elligator  Polarized, UV Protection Rectangular Sunglasse...  ₹249
98           SRPM      UV Protection Wayfarer Sunglasses (Free Size)  ₹169
99  VINCENT CHASE               UV Protection Sports Sunglasses (65)  ₹879

[100 rows x 3 columns]

In [76]:
#Q5.Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link: https://www.flipkart.com/apple-iphone-11-black-64-gb/productreviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market place=FLIPKART

In [77]:
# Opening the flipkart page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [78]:
# # Entering “iphone11” in the search field

find_2=driver.find_element(By.CLASS_NAME,"_3704LK")
find_2.send_keys("iphone11")

In [79]:
#click the search icon
search=driver.find_element(By.XPATH,"/html/body/div/div/div[1]/div[1]/div[2]/div[2]/form/div/button")
search.click()

In [83]:
# opening https://www.flipkart.com/apple-iphone-11-black-64-gb/productreviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market place=FLIPKART
click= driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[5]/div/div/div/a/div[2]/div[1]/div[1]")
click.click()

In [84]:
# Creating empty list 
Rating=[]
Review_summary=[]
Full_review=[]

In [121]:
# Scrapping Rating 
rating=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in rating[0:100]:
    R=i.text
    Rating.append(R)

    
# Scrapping Review summary   
reviwsummary=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in reviwsummary[0:100]:
    rv=i.text
    Review_summary.append(rv)
   
# scrapping Full review   
review=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
for i in review[0:100]:
    rvs=i.text
    Full_review.append(rvs)

In [122]:
#checking the lenght of the lists
print(len(Rating),len(Review_summary),len(Full_review))

144 108 102

In [123]:
# Creating the data frame.
data_frame5=pd.DataFrame({'Rating':Rating[0:100], 'Review summary':Review_summary[0:100], 'Full Review':Full_review[0:100]})
data_frame5

,Rating,Review summary,Full Review
0,4,Good quality product,impressively Nice......\nOne of the greatest i...
1,5,Perfect product!,Nice products thanks flkat
2,5,Simply awesome,Really satisfied with the Product I received.....
3,5,Terrific purchase,Good 👍 phone 🤳 lucky ❤️😘
4,5,Fabulous!,Fast performance to previous iPhone x\nGood ca...
...,...,...,...
95,5,Great product,Awesome product ❤️❤️\nThank you Flipkart
96,4,Good quality product,impressively Nice......\nOne of the greatest i...
97,5,Perfect product!,Nice products thanks flkat
98,5,Simply awesome,Really satisfied with the Product I received.....
99,5,Terrific purchase,Good 👍 phone 🤳 lucky ❤️😘

In [124]:
#Q6. : Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field

In [125]:
# Opening the flipkart page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [126]:
# Entering “sneakers” in the search field
find=driver.find_element(By.CLASS_NAME,"_3704LK")
find.send_keys('sneakers')

In [127]:
#click the search icon
search=driver.find_element(By.XPATH,"/html/body/div/div/div[1]/div[1]/div[2]/div[2]/form/div/button")
search.click()

In [138]:
Brand_1=[]
Product_description=[]
price_1=[]

In [143]:
# Scrapping brand name 
brand_name_2=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_name_2[0:100]:
    brandnames=i.text
    Brand_1.append(brandnames)
    
    
# Scrapping product description   
    
product_description=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in product_description[0:100]:
    bd=i.text
    Product_description.append(bd)
    
    
# Scrapping price 

pric=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in pric[0:100]:
    pr=i.text
    price_1.append(pr)

In [144]:
print(len(Brand_1),len(Product_description),len(price_1))

120 120 120

In [145]:
#Creating the Data Frame.
data_frame6=pd.DataFrame({'Brande':Brand_1[0:100], 'Product Description':Product_description[0:100], 'Price':price_1[0:100]})
data_frame6

          Brande                                Product Description Price
0       RapidBox                                   Sneakers For Men  ₹579
1   K- FOOTLANCE                                   Sneakers For Men  ₹399
2         Layasa  Casual Sneakers White Shoes For Girls And Snea...  ₹449
3           aadi  Synthetic| Lightweight| Premiun| Comfort| Summ...  ₹299
4          BIRDE      Combo Pack Of 2 Casual Shoes Sneakers For Men  ₹499
..           ...                                                ...   ...
95        Labbin                                   Sneakers For Men  ₹379
96          aadi  Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...  ₹299
97         BIRDE  Premium Sports Shoes For Men Pack Of 2 Sneaker...  ₹499
98        BRUTON               Modern Trendy Shoes Sneakers For Men  ₹249
99          aadi  Lightweight,Comfort,Summer,Trendy,Walking,Outd...  ₹299

[100 rows x 3 columns]

In [158]:
# Q7.Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image:

In [180]:
# Opening the amazon page on automated chrome browser
driver.get("https://www.amazon.in/")

In [181]:
# enter Laption in the search 
search_g= driver.find_element(By.XPATH,"//input[@type='text']")
search_g.send_keys('Laptop')

In [182]:
# click on search bar
search_btn=driver.find_element(By.XPATH,"//input[@id='nav-search-submit-button']")
search_btn.click()

In [183]:
##apply the CPU filter by checking the respective box
location_filter_cpu=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[7]/span[13]/li/span/a/span")
location_filter_cpu.click()

In [184]:
#Creating Empty list
Title_3=[]
Ratings_3=[]
Price_3=[]

In [193]:
# Scrapping Title  
Title3=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in Title3[0:10]:
    title=i.text
    Title_3.append(title)
    
# Scrapping Rating 
ratingss=driver.find_elements(By.XPATH,'//div[@class="a-row a-spacing-medium"]')
for i in ratingss[0:10]:
    Rtng=i.text
    Ratings_3.append(Rtng)
    
# Scrapping price 

pricss=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in pricss[0:10]:
    prc=i.text
    Price_3.append(prc)

In [194]:
#Checking the lenght
print(len(Title_3),len(Ratings_3),len(Price_3))

40 16 40

In [195]:
#Creating the Data Frame.
data_frame6=pd.DataFrame({'Title':Title_3[0:10], 'Ratings':Ratings_3[0:10], 'Price':Price_3[0:10]})
data_frame6

                                               Title Ratings     Price
0  ASUS TUF Gaming F15 (2022), 15.6"(39.62 cms) F...            94,989
1  Lenovo ThinkPad E14 Intel Core i7 12th Gen 14"...            98,990
2  HP Envy x360 12th Gen Intel Core i7-13.3 inch(...          1,02,990
3  Samsung Galaxy Book2 (NP750) Intel 12th Gen co...            79,990
4  LG Gram16 Intel EVO-[12th Gen Core i7/Win11/16...            99,990
5  HP Victus Gaming Latest 12th Gen Intel Core i7...            79,990
6  ASUS Zenbook Pro 14 Duo OLED (2022) Dual Scree...          1,24,990
7  Acer Predator Helios Neo 16 Gaming Laptop 13th...          1,29,990
8  HP Pavilion Plus, 12th Gen Intel Core i7 16GB ...            88,990
9  HP Envy x360 for Creators 12th Gen Intel Core ...            97,990

In [ ]:
#Q8. Write a python program to scrape data for Top 1000 Quotes of All Time.

In [298]:
import selenium
import pandas as pd
from selenium import webdriver
import time
from selenium.common.exceptions import NoSuchElementException
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By

#connecting Webdriver
driver = webdriver.Chrome(r'E:\HP\Desktop\Internship\chromedriver.exe')
driver

url="https://www.azquotes.com/"
driver.get(url)

In [299]:
Quote=[]
Author=[]
Type_Quote=[]

In [300]:
# Scarpping Quote from the given page
quote_tags=driver.find_elements(By.XPATH,'//a[@class="title"]')
for i in quote_tags[0:100]:
    quote=i.text
    Quote.append(quote)

In [301]:
# Scarpping Autor from the given page
author_tags=driver.find_elements(By.XPATH,'//div[@class="author"]')
for i in author_tags[0:100]:
    author=i.text
    Author.append(author)

In [302]:
# Scarpping Type of Quote from the given page
type_quote_tags=driver.find_elements(By.XPATH,'//div[@class="tags"]')
for i in type_quote_tags[0:100]:
    type_quote=i.text
    Type_Quote.append(type_quote)

In [304]:
print(len(Quote),len(Author), len(Type_Quote))

14 0 0

In [ ]:
# lenght of all 3 items are not qual so not able to do data frame

In [212]:
#Q9. Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/.

In [218]:
#1 First get the webpagehttps://www.jagranjosh.com/
driver.get("https://www.jagranjosh.com/")

In [219]:
# 2 click on the GK option
click_on_gk=driver.find_element(By.XPATH,"/html/body/div/div[1]/div/div[1]/div/div[5]/div/div[1]/header/div[3]/ul/li[3]/a")
click_on_gk.click()

In [221]:
#3  click on the List of all Prime Ministers of India
prime_ministers=driver.find_element(By.XPATH,"/html/body/div[1]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a")
prime_ministers.click()

In [226]:
#creating empty list
Name=[]
Born_Dead = [] 
Term_of_office=[] 
Remarks=[]

In [234]:
# Scrapping name

primeminister=driver.find_elements(By.XPATH,'/html/body/div/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[2]/table/tbody/tr[2]/td[2]/p')
for i in primeminister:
    names=i.text
    Name.append(names)
    
# Scrapping Born_Dead

dates=driver.find_elements(By.XPATH,'/html/body/div/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[2]/table/tbody/tr[2]/td[3]/p')
for i in dates:
    dt=i.text
    Born_Dead.append(dt)
    
# Scrapping Term_of_office
termofoffice=driver.find_elements(By.XPATH,'/html/body/div/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[2]/table/tbody/tr[2]/td[4]/p[1]/span')
for i in termofoffice:
    trms=i.text
    Term_of_office.append(trms)
    
# Scrapping Remarks

remark=driver.find_elements(By.XPATH,'/html/body/div/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[2]/table/tbody/tr[2]/td[5]/p')
for i in remark:
    rmk=i.text
    Remarks.append(rmk)

In [235]:
print(len(Name),len(Born_Dead),len(Term_of_office),len(Remarks))

3 3 3 3

In [236]:
#Creating the Data Frame.
data_frame9=pd.DataFrame({'Name':Name, 'Born Dead':Born_Dead, 'Term of office':Term_of_office,'Remarks':Remarks})
data_frame9

,Name,Born Dead,Term of office,Remarks
0,Jawahar Lal Nehru,(1889–1964),"15 August 1947 to 27 May 1964\n16 years, 286 days",The first prime minister of India and the long...
1,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,The first prime minister of India and the long...
2,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,The first prime minister of India and the long...

In [ ]:
#Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/ This task will be done in following steps:First get the webpagehttps://www.motor1.com/
#Then You have to click on the List option from Dropdown menu on leftside.
#Then click on 50 most expensive carsin the world..
#Then scrap the mentioned data and make the dataframe

In [265]:
import selenium
import pandas as pd
from selenium import webdriver
import time
from selenium.common.exceptions import NoSuchElementException
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By

In [266]:

#connecting Webdriver
driver = webdriver.Chrome(r'E:\HP\Desktop\Internship\chromedriver.exe')
driver

url="https://www.motor1.com/ "
driver.get(url)

In [267]:
top50=driver.find_element(By.ID,"search_input")
top50.send_keys("50 most expensive cars")

In [268]:
cl=driver.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
cl.click()

In [269]:
EX=driver.find_element(By.XPATH,'/html/body/div[3]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
EX.click()

In [270]:
Car=[]
name=driver.find_elements(By.TAG_NAME,"h3")
for i in name:
    Car.append(i.text)

In [271]:
print(Car.remove("Most Expensive Cars In The World"))

None

In [272]:
Price=[]
p=driver.find_elements(By.XPATH,'/html/body/div[3]/div[7]/div[2]/div[1]/div[2]/div[1]/p/strong')
for i in p:
    Price.append((i.text.split("$"))[-1])

In [273]:
df=pd.DataFrame({"Car Name":Car,"Price":Price})
print('\033[1m'+'Most Expensive Cars in the world :'+'\033[0m')
df

Most Expensive Cars in the world :

                           Car Name                Price
0                     De Tomaso P72          1.3 Million
1                 Ferrari LaFerrari          1.4 Million
2                     Pagani Huayra          1.4 Million
3                      McLaren Elva
4                       Czinger 21C          1.7 Million
5                     Ferrari Monza          1.7 Million
6                Gordon Murray T.33          1.7 Million
7                 Koenigsegg Gemera          1.7 Million
8                       Zenvo TSR-S          1.7 Million
9                Hennessey Venom F5          1.7 Million
10                  Bentley Bacalar          1.8 Million
11    Hispano Suiza Carmen Boulogne          1.9 Million
12           Bentley Mulliner Batur          1.9 Million
13                     Deus Vayanne          2.0 Million
14                      SSC Tuatara          2.0 Million
15                      Lotus Evija         2.0 Million*
16              Aston Martin Vulcan          2.1 Million
17                       Delage D12          2.3 Million
18                McLaren Speedtail          2.3 Million
19                     Rimac Nevera          2.3 Million
20                    Pagani Utopia          2.4 Million
21             Pininfarina Battista          2.5 Million
22                Ferrari FXX K Evo          2.5 Million
23               Gordon Murray T.50          2.6 Million
24             Lamborghini Countach          2.6 Million
25         Mercedes-AMG Project One          2.6 Million
26              Aston Martin Victor          2.7 Million
27      Hennessey Venom F5 Roadster          3.0 Million
28                 Koenigsegg Jesko          3.0 Million
29            Aston Martin Valkyrie          3.0 Million
30        W Motors Lykan Hypersport          3.2 Million
31                    McLaren Solus          3.4 Million
32        Pagani Huayra Roadster BC          3.5 Million
33         Bugatti Chiron Pur Sport          3.5 Million
34                 Lamborghini Sian          3.6 Million
35                 Koenigsegg CC850          3.6 million
36  Bugatti Chiron Super Sport 300+          3.7 Million
37               Lamborghini Veneno          3.9 Million
38                   Bugatti Bolide          4.5 Million
39                  Bugatti Mistral          4.7 Million
40              Pagani Huayra Imola          5.0 Million
41                     Bugatti Divo          5.4 Million
42              SP Automotive Chaos          5.8 Million
43                 Pagani Codalunga          6.4 Million
44         Mercedes-Maybach Exelero          7.4 Million
45               Bugatti Centodieci          8.0 Million
46          Bugatti Chiron Profilée          9.0 Million
47             Rolls-Royce Sweptail         10.8 Million
48         Bugatti La Voiture Noire         12.8 Million
49           Rolls-Royce Boat Tail*         13.4 Million
50                             FAQs  28.0 Million (est.)